UBC-Solar/firmware_v3/components/did/did.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F1
ProjectManager.MainLocation=Core/Src
PC7.GPIOParameters=GPIO_Label
ProjectManager.ProjectFileName=did.ioc
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F103RCTx
PC10.GPIO_Label=DB7
Mcu.PinsNb=17
PC9.GPIO_Label=DB6
ProjectManager.NoMain=false
PC11.Locked=true
PC12.Locked=true
PC10.Locked=true
CAN.CalculateBaudRate=166666
RCC.PLLCLKFreq_Value=8000000
PC10.Signal=GPIO_Output
PC11.Signal=GPIO_Output
PC12.Signal=GPIO_Output
PC5.Locked=true
PC7.Locked=true
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_CAN_Init-CAN-false-HAL-true
PC0.GPIOParameters=GPIO_Label
PC8.Signal=GPIO_Output
PC4.Signal=GPIO_Output
PC2.Signal=GPIO_Output
PC6.Signal=GPIO_Output
PC6.GPIO_Label=DB3
PC0.GPIO_Label=A0
PC3.Locked=true
PC9.Locked=true
ProjectManager.DefaultFWLocation=true
ProjectManager.DeletePrevious=true
PC0.Signal=GPIO_Output
PC1.Locked=true
PC11.GPIOParameters=GPIO_Label
VP_SYS_VS_ND.Mode=No_Debug
CAN.CalculateTimeBit=6000.00
PinOutPanel.RotationAngle=0
RCC.FamilyName=M
ProjectManager.StackSize=0x400
PC3.GPIOParameters=GPIO_Label
PC8.GPIO_Label=DB5
PC12.GPIOParameters=GPIO_Label
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP2=RCC
Mcu.IP3=SYS
Mcu.IP0=CAN
Mcu.IP1=NVIC
Mcu.UserConstants=
ProjectManager.TargetToolchain=STM32CubeIDE
PC1.GPIOParameters=GPIO_Label
Mcu.ThirdPartyNb=0
Mcu.IPNb=4
ProjectManager.PreviousToolchain=
PC5.GPIOParameters=GPIO_Label
PC6.Locked=true
PB9.Mode=CAN_Activate
PC7.Signal=GPIO_Output
PB9.Locked=true
PC3.Signal=GPIO_Output
Mcu.Pin6=PC6
PC2.Locked=true
Mcu.Pin7=PC7
ProjectManager.RegisterCallBack=
Mcu.Pin8=PC8
Mcu.Pin9=PC9
Mcu.Pin0=PC0
Mcu.Pin1=PC1
Mcu.Pin2=PC2
Mcu.Pin3=PC3
Mcu.Pin4=PC4
Mcu.Pin5=PC5
ProjectManager.ProjectBuild=false
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
board=custom
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
ProjectManager.LastFirmware=true
ProjectManager.FirmwarePackage=STM32Cube FW_F1 V1.8.3
MxDb.Version=DB.6.0.20
RCC.APB2Freq_Value=8000000
ProjectManager.BackupPrevious=false
MxCube.Version=6.2.0
PC4.GPIO_Label=DB1
PC2.GPIOParameters=GPIO_Label
PC11.GPIO_Label=CS
File.Version=6
PC1.GPIO_Label=WR
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_ND.Signal=SYS_VS_ND
PB8.Locked=true
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
CAN.IPParameters=CalculateTimeQuantum,CalculateTimeBit,CalculateBaudRate
PC10.GPIOParameters=GPIO_Label
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.FreePins=false
RCC.IPParameters=APB1Freq_Value,APB2Freq_Value,FamilyName,PLLCLKFreq_Value,PLLMCOFreq_Value,TimSysFreq_Value
PC9.GPIOParameters=GPIO_Label
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F103R(C-D-E)Tx
CAN.CalculateTimeQuantum=2000.0
ProjectManager.HalAssertFull=false
ProjectManager.ProjectName=did
ProjectManager.UnderRoot=true
PC7.GPIO_Label=DB4
RCC.PLLMCOFreq_Value=4000000
ProjectManager.CoupleFile=true
PC8.GPIOParameters=GPIO_Label
Mcu.Package=LQFP64
PB9.Signal=CAN_TX
RCC.TimSysFreq_Value=8000000
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
PC5.GPIO_Label=DB2
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PC12.GPIO_Label=RES
ProjectManager.CompilerOptimize=6
ProjectManager.ToolChainLocation=
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
ProjectManager.HeapSize=0x200
Mcu.Pin15=VP_SYS_VS_ND
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=VP_SYS_VS_Systick
Mcu.Pin13=PB8
PC6.GPIOParameters=GPIO_Label
Mcu.Pin14=PB9
ProjectManager.ComputerToolchain=false
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=PC11
Mcu.Pin12=PC12
PB8.Mode=CAN_Activate
Mcu.Pin10=PC10
PB8.Signal=CAN_RX
PC3.GPIO_Label=DB0
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PC4.Locked=true
PC8.Locked=true
PC5.Signal=GPIO_Output
PC9.Signal=GPIO_Output
RCC.APB1Freq_Value=8000000
PC2.GPIO_Label=RD
ProjectManager.CustomerFirmwarePackage=
PC0.Locked=true
PC4.GPIOParameters=GPIO_Label
ProjectManager.DeviceId=STM32F103RCTx
PC1.Signal=GPIO_Output
ProjectManager.LibraryCopy=1
isbadioc=false
